{
  "notes": [
    {
      "id": "2",
      "title": "informal fallacy",
      "body": "A fallacy is a mistaken belief, or an error in reasoning, but not simply incorrectness about facts. Fallacies in arguments take on many forms, but you can boil them down into 2 categories: formal and informal.<sup>1</sup> Formal fallacies are easier to detect since there is a logical breakdown in the structure of the argument. The conclusion of the argument can even be true, but if it doesn't properly follow its premises, then it is a formal fallacy. Then there are informal fallacies which may have valid argumentative form, or technical structure, but there is a vital characteristic problem in one or more of the premises.<sup>2</sup> There are many entertaining examples of these.<br><br>Giving a title to the insane things I hear people say every day feels good. I now realize I am not insane (well... ). You can find a list of the types of informal fallacies in a few places<sup>3 4 5</sup>; however, I liked the presentation put together by The Department of Philosophy at Texas State the most.<sup>6</sup> I'd now like to give my own examples of my favorite fallacies.<br><br><b>Ad Hominem</b> <i>attacking the person</i><br><i>Zach</i>: Let's go to that new Mexican place over on 7th. It is so good.<br><i>Dummy</i>: Hey Zach, let's not do that. Your skinny jeans are way too tight for you to be discernible about good food.<br><br><b>Confusion of Necessary with a Sufficient Condition</b><br><i>Dummy</i>: When is the last time you dated a girl?<br><i>Zach</i>: I don't know. Shutup.<br><i>Dummy</i>: You must be gay.<br><br><b>False Dilemma</b> <i>either-or positions</i><br><i>Dummy</i>: You either know how to pour a bottle of El Reliz Reposado or you are racist.<br><br><b>Slippery Slope</b> <i>chain reaction</i><br><i>Zach</i>: I'm starving, let's get macarons.<br><i>Dummy</i>: No. First, you eat one macaroon. Then it's noon and you've already eaten 24. Before you know it, you've quit your solid day job to start learning card magic like Dave Franco in Now You See Me to be able to steal macarons at Chantal Guillon to satisfy your maniacal macaron craving. You've been a cashier there for months now and Cindy is starting to notice a huge dent in the books for which you've been building a case against Tamara. Due to the evidence, Cindy fires Tamara and now Tamara is dropping out of pastry school simultaneously destroying her dream of ever being on Cupcake Wars. Is that what you want, Zach?<br><br><div id=\"refs\"><div id=\"ref_row\">1 <a href=\"https://en.wikipedia.org/wiki/Formal_fallacy\">Formal fallacy</a></div><div id=\"ref_row\">2 <a href=\"http://www.triviumpursuit.com/articles/formal_informal_fallacies.php\">Formal and Informal Fallacies</a></div><div id=\"ref_row\">3 <a href=\"http://www.nizkor.org/features/fallacies/\">Fallacies</a></div><div id=\"ref_row\">4 <a href=\"https://en.wikipedia.org/wiki/List_of_fallacies\">List of fallacies</a></div><div id=\"ref_row\">5 <a href=\"https://www.youtube.com/watch?v=8qb-h0sXkH4\">Five Fallacies</a></div><div id=\"ref_row\">6 <a href=\"http://www.txstate.edu/philosophy/resources/fallacy-definitions.html\">Informal Fallacies</a></div></div>",
      "ts": 1488154751000
    },
    {
      "id": "1",
      "title": "preemptive thanks",
      "body": "This is thanking someone for a service he has not yet provided, but assuming he will since you asked.<br><br>Here's an example, \"Hey Zach, I have this <i>stupid blah</i> I need to <i>lame</i> before I <i>don't care</i>. Can you wait on me for 15 minutes until I'm done? Thanks.\"<br><br>Uh.. you're welcome? I guess I have no choice but to wait on you since you're assuming I am ok doing that kind of thing for you. Did that make things easier and more assuring for your lunch plans with me? To give me a <i>Thanks</i>, rather than asking and giving me the option of deciding if you are worth waiting on?<br><br>Turns out, it would've been bad for you giving me the option, so... well played. But next time, our lunch plans are CANCELLED.<br><br>NO THANKS!",
      "ts": 1487916908000
    }
  ]
}
